tutorials/combustion/XiFoam/les/pitzDaily3D/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminarFlameSpeedCorrelation Gulders;

fuel            Propane;

Su              Su [0 1 -1 0 0 0 0] 0.135;

SuModel         transport;

equivalenceRatio equivalenceRatio [0 0 0 0 0 0 0] 0.6;

sigmaExt        sigmaExt [0 0 -1 0 0 0 0] 338;

XiModel         transport;

XiCoef          XiCoef [0 0 0 0 0 0 0] 0.62;

XiShapeCoef     XiShapeCoef [0 0 0 0 0 0 0] 1;

uPrimeCoef      uPrimeCoef [0 0 0 0 0 0 0] 1;

GuldersCoeffs
{
    Methane
    {
        W               0.422;
        eta             0.15;
        xi              5.18;
        alpha           2;
        beta            -0.5;
        f               2.3;
    }

    Propane
    {
        W               0.446;
        eta             0.12;
        xi              4.95;
        alpha           1.77;
        beta            -0.2;
        f               2.3;
    }

    IsoOctane
    {
        W               0.4658;
        eta             -0.326;
        xi              4.48;
        alpha           1.56;
        beta            -0.22;
        f               2.3;
    }
}

ignite     yes;

ignitionSites
(
    {
        location (0.005 -0.02 0.01905);
        diameter 0.003;
        start 0;
        duration 0.1;
        strength 200;
    }
);

ignitionSphereFraction 1;

ignitionThickness ignitionThickness [0 1 0 0 0 0 0] 0;

ignitionCircleFraction 0;

ignitionKernelArea ignitionKernelArea [0 2 0 0 0 0 0] 0;


// ************************************************************************* //
